---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExclusionFilter
source: html/bb430066-fae7-df60-81a5-e787d6a3b6ea.htm
---
# ExclusionFilter Members

Constructs a new instance of a filter to exclude elements automatically.